# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 27 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 31 (P3/8-small)  17

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 34 (P4/16-medium)  20

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 37 (P5/32-large)  23


   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 38 24
   [[-1, 20], 1, Concat, [1]],  # cat backbone P4 #42  28
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 17], 1, Concat, [1]],  # cat backbone P3 #47  33
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #51 37
   [-1, 1, Conv, [512, 1, 1, None, 1, False]],
   [-1, 1, Conv, [256, 1, 1, None, 1, False]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #55  41
   [-1, 1, Conv, [128, 1, 1, None, 1, False]],
   [-1, 1, Conv, [32, 1, 1, None, 1, False]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #59  45
   [-1, 1, Conv, [1, 1, 1, None, 1, False]], #62  48
  ]
